//JS01 EXEC PGM=DLLMAIN,
// PARM=' /HEAP(200M,6M,ANYWHERE,KEEP,,),RPTSTG(ON),RPTOPTS(ON)'
//STEPLIB DD DSN=YOUR.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*